{
	"_meta": {
		"sources": [
			{
				"json": "ArcaneArtillery",
				"abbreviation": "AA",
				"full": "Arcane Artillery: The Gun Nut's Guide for 5th Edition",
				"authors": ["Zow aka /u/ZoeJr"],
				"version": "1.0.0",
				"url": "https://www.reddit.com/r/UnearthedArcana/comments/6om1nu/arcane_artillery_the_gun_nuts_guide_final_edition/",
				"convertedBy": ["mrtheduts"],
				"targetSchema": "2.0.0"
			}
		],
		"optionalFeatureTypes": {
			"FS:GS": "Fighting Style, Gunslinger",
			"LI:BF": "Lucky Item, Benefit",
			"LI:QR": "Lucky Item, Quirk",
			"TRKS": "Tricks"
		},
		"dateAdded": 0,
		"dateLastModified": 0
	},
	"feat": [
		{
			"name": "Akimbo Master",
			"source": "ArcaneArtillery",
			"page": 9,
			"entries": [
				"You master the art of wielding two ranged weapons at once. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You can draw or holster two sidearms when you would normally be able to draw or holster only one.",
						"If you are wielding two ranged weapons with the loading property, you can ignore the loading property for those weapons, and do not need a free hand to reload them.",
						"You can wield two one-handed ranged weapons at once, even if they do not have the light property."
					]
				}
			]
		},
		{
			"name": "Archaic Gunmaster",
			"source": "ArcaneArtillery",
			"page": 9,
			"prerequisite": [
				{
					"other": "Primitive & Misfire Rules implemented"
				}
			],
			"entries": [
				"You have become well trained with primitive firearms. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you make more than two attacks with a primitive firearm during your turn, the firearm's misfire count does not increase by 1.",
						"These weapons only misfire for you if you roll a 1, regardless of its misfire number.",
						"Ignore the loading property for non-heavy firearms"
					]
				}
			]
		},
		{
			"name": "Gunmaster",
			"source": "ArcaneArtillery",
			"page": 9,
			"entries": [
				"You are a veritable master with guns, and gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Ignore the loading property for non-heavy firearms.",
						"If you are disarmed, you can use your reaction to draw and fire a light sidearm.",
						"Increase the normal range of all firearms you wield by 10."
					]
				}
			]
		},
		{
			"name": "Bayoneteer",
			"source": "ArcaneArtillery",
			"page": 9,
			"prerequisite": [
				{
					"proficiency": [
						{
							"weapon": "firearm"
						}
					]
				}
			],
			"entries": [
				"You have mastered the art of fighting with weapons attached to the barrel of your gun. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to damage rolls with bayonets.",
						"You gain proficiency in improvised weapons.",
						"Firearms with bayonets attached gain a reach of 10 feet.",
						"When you take the attack action with a firearm that has a bayonet attached to it, you can use a bonus action to make a melee attack with the bayonet at a creature within 5 feet of you."
					]
				}
			]
		},
		{
			"name": "Buccaneer",
			"source": "ArcaneArtillery",
			"page": 9,
			"entries": [
				"You have mastered the art of dueling with gun and sword, and gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you use the attack action with a one-handed melee weapon, you can spend a bonus action to fire a light firearm you wield in your other hand. You can use this bonus action to attack with a one handed melee weapon if you use your attack action with a light firearm.",
						"While wielding a light firearm and a one-handed melee weapon, you gain a +1 bonus to your AC.",
						"Ignore the loading time and reload action for light firearms. You do not need a free hand to load in the ammunition."
					]
				}
			]
		},
		{
			"name": "Close Quarters Shooter",
			"source": "ArcaneArtillery",
			"page": 9,
			"entries": [
				"You have trained yourself in the delicate art of using ranged weapons in close quarters combat. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Making an attack with a ranged weapon while within 5 feet of a hostile creature does not impose disadvantage on the attack roll.",
						"You cannot make a ranged attack roll with disadvantage at any target within 30 feet of you. However, if you would normally have disadvantage when making an attack roll within this range, such as a magical effect or obscured vision, you cannot get advantage on the attack roll either.",
						"You can make opportunity attacks with ranged weapons. The reach for these attacks is 15 feet."
					]
				}
			]
		},
		{
			"name": "Gunsmith Initiate",
			"source": "ArcaneArtillery",
			"page": 9,
			"prerequisite": [
				{
					"ability": [
						{
							"int": 13
						}
					],
					"otherSummary": [
						{
							"entry": "proficiency in smith's tools or tinker's tools",
							"entrySummary": "smith's tools or tinker's tools"
						}
					]
				}
			],
			"entries": [
				"Your proficiency bonus is doubled in tinker's tools and/or smith's tools, and you can now craft primitive firearms. You are assumed to have gotten the materials for the firearm you wish to craft before you took this feat. You craft these guns at a rate of 5gp per hour."
			]
		},
		{
			"name": "Gunsmith Adept",
			"source": "ArcaneArtillery",
			"page": 9,
			"prerequisite": [
				{
					"level": 12,
					"other": "{@feat Gunsmith Initiate|ArcaneArtillery}"
				}
			],
			"entries": [
				"You have gone through extensive training in gunsmithing, letting you create new firearms via experimenting. You can now create firearms, found on the chart above. You can craft special firearms, as well as Attachments and Custom Parts, if it is appropriate for your setting (such as if firearms are prominent). Once per long rest, you can make an Intelligence check with your proficiency bonus added once you complete a short rest. If you succeed, you manage to craft the blueprints for the gun or parts (the DCs are listed on the charts above). If you fail, the DC goes down by 1 for subsequent checks (Minimum of 10).",
				"You have gone through extensive training in gunsmithing, letting you create new firearms via experimenting. You can now create firearms, found on the chart above. You can craft special firearms, as well as Attachments and Custom Parts, if it is appropriate for your setting (such as if firearms are prominent). Once per long rest, you can make an Intelligence check with your proficiency bonus added once you complete a short rest. If you succeed, you manage to craft the blueprints for the gun or parts (the DCs are listed on the charts above). If you fail, the DC goes down by 1 for subsequent checks (Minimum of 10).",
				"The cost to craft primitive firearms is now cut in half for you (rounded up).",
				"You can now reduce a primitive firearm's misfire number to a minimum of 1, regardless of its original misfire number."
			]
		},
		{
			"name": "Heavy Weapons Guy",
			"source": "ArcaneArtillery",
			"page": 10,
			"prerequisite": [
				{
					"ability": [
						{
							"str": 16
						}
					]
				}
			],
			"entries": [
				"You have strengthened yourself to be able to use large and unwieldy firearms more effectively. If you have the {@classFeature Extra Attack|Gunslinger|ArcaneArtillery|5|ArcaneArtillery} feature, you can use a single one of those attacks when you use those features with a bulky firearm. Ignore the loading property once per turn for these weapons."
			]
		},
		{
			"name": "Mounted Shooting",
			"source": "ArcaneArtillery",
			"page": 10,
			"entries": [
				"You wield guns with deadly efficiency on mounts. While you are mounted and aren't incapacitated, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You get a +1 bonus to attack rolls with firearms while mounted.",
						"Being within 5 feet of a hostile creature when making an attack roll with firearms while mounted does not impose disadvantage on the attack roll as long as the creature's size is smaller than your mount.",
						"You have advantage on attacks rolls against any unmounted creature smaller than your mount within your firearm's normal range."
					]
				}
			]
		},
		{
			"name": "Pistol Whipper ",
			"source": "ArcaneArtillery",
			"page": 10,
			"entries": [
				"You are skilled in using guns as melee weapons when and if they run out of bullets. You increase your Strength or Dexterity ability score by 1, to a maximum of 20, and are now considered proficient with firearms you use as melee weapons.",
				"The damage die for these firearms is as follows: sidearms are {@dice 1d6}, and they are considered finesse weapons, longarms are {@dice 1d8}, and heavy longarms are {@dice 1d10}. The damage type for these attacks is bludgeoning."
			],
			"ability": [
				{
					"choose": {
						"from": ["str", "dex"],
						"amount": 1
					}
				}
			],
			"increase": ["strength", "dexterity"]
		},

		{
			"name": "Rifle Master",
			"source": "ArcaneArtillery",
			"page": 10,
			"entries": [
				"Rifles are complex weapons, but you know just how to make every shot count. You gain the following benefits when wielding a rifle, carbine, or a musket and wheel lock gun with the rifling property:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to damage rolls with these weapons.",
						"You can reroll 1s and 2s to damage with these weapons.",
						"If you roll a critical hit or deal a killing blow with these weapons, you can use your reaction to take an additional shot at a creature within 10 feet of the creature hit.",
						"The normal range of these weapons increases by 10, and the long range increases by 30."
					]
				}
			]
		},
		{
			"name": "Scattershot Master",
			"source": "ArcaneArtillery",
			"page": 10,
			"entries": [
				"You have mastered getting the most effect out of firearms with the scatter property. You get the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain a +1 to attack rolls with these weapons.",
						"Your scattershot damage can target any creature of your choosing within the scatter range of your target.",
						"You can reroll 1s and 2s to your scatter damage.",
						"You can load all of the ammo for shell loading firearms with the scatter property using a bonus action."
					]
				}
			]
		},
		{
			"name": "Sidearm Master",
			"source": "ArcaneArtillery",
			"page": 10,
			"entries": [
				"You have mastered the art of wielding a sidearm with delicate precision. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to attack rolls made with these weapons.",
						"When you take the attack action with a sidearm can use a bonus action to make an attack roll at a creature within 10 feet of you.",
						"When you roll initiative and are not surprised, you can use your reaction to draw a sidearm and attack a creature within its normal range."
					]
				}
			]
		},
		{
			"name": "Six-Gun Ace",
			"source": "ArcaneArtillery",
			"page": 10,
			"entries": [
				"You have perfected the art of shooting with your revolver or hand cannon. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to attack rolls with these weapons.",
						"You cannot be disarmed while wielding a revolver or hand cannon in one hand and your other hand is free.",
						"When you make an attack with your revolver or hand cannon and are not holding anything in your other hand, you can use your bonus action to make two additional attacks against creatures within its normal range. You do not add your ability score modifier to the damage of these attacks, unless that modifier is negative."
					]
				}
			]
		},
		{
			"name": "Superior Marksman",
			"source": "ArcaneArtillery",
			"page": 11,
			"entries": [
				"You have perfected the art of the slow, steady kill. You gain the following benefits",
				{
					"type": "list",
					"items": [
						"You gain a +1 to attack rolls with these weapons.",
						"You can use a bonus action to steady your aim. You can then make an attack roll that can neither have advantage or disadvantage. On a hit, deal double the weapon’s damage die.",
						"If you make a ranged attack roll with advantage, you can reroll one of the attack rolls once."
					]
				}
			]
		},
		{
			"name": "Suppressive Fire",
			"source": "ArcaneArtillery",
			"page": 11,
			"entries": [
				"When you have a firearm with the automatic or burst fire property drawn, you can use an action to suppress a field of fire within a 10 foot radius at any point within your weapon's normal range. This ability expends a number of bullets equal to half your firearm's total reload count when used. You cannot take bonus actions if you take this action. You must have at least half your gun's reload count loaded into your weapon to use this ability. When you use this ability, you gain the following benefits until the beginning of your next turn.",
				{
					"type": "list",
					"items": [
						"Creatures within the area have disadvantage on attack rolls and Dexterity Saving Throws.",
						"Creatures within the area can only move at half speed and cannot Dash.",
						"If any creatures move or take an action within the area or moves into its area for the first time, you can make an attack against them. You can make this attack for a number of times equal to half your proficiency bonus. You cannot make this attack at the same creature more than once. This attack does not expend ammunition."
					]
				}
			]
		},
		{
			"name": "Tricky",
			"source": "ArcaneArtillery",
			"page": 11,
			"entries": [
				"You have trained in a performance art with firearms that allows you to use special tricks during combat. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn two tricks of your choice from among those available to the {@class Gunslinger|ArcaneArtillery|Gunslinger with the Virtuoso Archetype|Virtuoso} class. If a trick requires your target to make a saving throw to resist the trick's effects, the saving throw DC equals 8 + your proficiency modifier + your Dexterity modifier.",
						"If you already have superiority dice, you gain two more, otherwise, you have two superiority dice. These are used to fuel your tricks. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest.",
						"If a trick's effect includes a modifier that equals your Gunslinger level, you instead treat that modifier as equal to your highest class level instead."
					]
				}
			]
		}
	],
	"class": [
		{
			"name": "Gunslinger",
			"source": "ArcaneArtillery",
			"hd": {
				"number": 1,
				"faces": 8
			},
			"proficiency": ["dex", "cha"],
			"startingProficiencies": {
				"armor": ["light", "medium", "{@item shield|phb|shields}"],
				"weapons": [
					"longarms",
					"sidearms",
					"simple weapons",
					"crossbows",
					"shortswords",
					"scimitars",
					"rapiers",
					"whips"
				],
				"tools": ["A vehicle or musical instrument of your choice"],
				"skills": [
					{
						"choose": {
							"from": [
								"arcana",
								"acrobatics",
								"animal handling",
								"history",
								"insight",
								"intimidation",
								"investigation",
								"perception",
								"performance",
								"persuasion",
								"sleight of hand",
								"survival"
							],
							"count": 2
						}
					}
				]
			},
			"startingEquipment": {
				"additionalFromBackground": true,
				"default": [""],
				"goldAlternative": "{@dice 5d4*10|5d4 x 10|Starting Gold}"
			},
			"multiclassing": {
				"requirements": {
					"dex": 13,
					"cha": 13
				},
				"proficienciesGained": {
					"weapons": ["longarms", "sidearms"],
					"tools": ["A vehicle of your choice"]
				}
			},
			"classFeatures": [
				"The Tongue|Gunslinger|ArcaneArtillery|1|ArcaneArtillery",
				"Quickdraw|Gunslinger|ArcaneArtillery|1|ArcaneArtillery",
				"Gun Stunts|Gunslinger|ArcaneArtillery|1|ArcaneArtillery",
				"Knack|Gunslinger|ArcaneArtillery|2|ArcaneArtillery",
				"Fighting Style|Gunslinger|ArcaneArtillery|2|ArcaneArtillery",
				"Slinger's Trail|Gunslinger|ArcaneArtillery|3|ArcaneArtillery",
				"Lucky Item|Gunslinger|ArcaneArtillery|3|ArcaneArtillery",
				"Ability Score Improvement|Gunslinger|ArcaneArtillery|4|ArcaneArtillery",
				"Extra Attack |Gunslinger|ArcaneArtillery|5|ArcaneArtillery",
				"Bullet Time|Gunslinger|ArcaneArtillery|6|ArcaneArtillery",
				"Evasion|Gunslinger|ArcaneArtillery|7|ArcaneArtillery",
				"Ability Score Improvement|Gunslinger|ArcaneArtillery|8|ArcaneArtillery",
				"Shootout Sense|Gunslinger|ArcaneArtillery|11|ArcaneArtillery",
				"Ability Score Improvement|Gunslinger|ArcaneArtillery|12|ArcaneArtillery",
				"Overwatch|Gunslinger|ArcaneArtillery|14|ArcaneArtillery",
				"Final Stand|Gunslinger|ArcaneArtillery|15|ArcaneArtillery",
				"Ability Score Improvement|Gunslinger|ArcaneArtillery|16|ArcaneArtillery",
				"Superhuman Reflexes|Gunslinger|ArcaneArtillery|18|ArcaneArtillery",
				"Ability Score Improvement|Gunslinger|ArcaneArtillery|19|ArcaneArtillery",
				"Gunslinger Supreme|Gunslinger|ArcaneArtillery|20|ArcaneArtillery"
			],
			"fluff": [
				{
					"name": "The Gunslinger",
					"type": "section",
					"entries": [
						"A Human finishes loading rounds into her gun and and runs straight into a pack of angry kobolds that are threatening her town. She tumbles and spins, her weapon burping out salvo after salvo of hot lead against the poorly armed draconians with naught but simple spears to use against her.",
						"Setting his perch up at the top of a tree, a Half Elf begins to train the custom built sights of his homemade rifle on his prize. Amidst the roaming herd of goblins and hobgoblins, there stands a single, massive fire giant shouting commands to the monsters near the edge of a cliff. As he lets out a haughty guffaw, the half-elf sees his opening. His lips curl into a grin, and he pulls the trigger.",
						"The sound of rapid clops echoes across the battlefield. A group of goblins tries to close in on a tiefling and her horse.  One of them throws a bomb at her horses feet, but in a flash, the horse and its rider suddenly dart to the side, and the bomb explodes among the crowd of pursuers instead, leaving the tiefling unharm",
						"A half orc examines a strange puzzle before him, holstering his gun after checking that the coast is clear. He looks befudded at it for a moment, before shrugging and messing around with it. With a click, the puzzle opens, and the half-orc smiles a giddy smile.",
						"Whether outlaws from a distant land trying to redeem themselves, swashbucklers with an eye for the explosive, or smiths that wish to show off their talents to the world in the heat of battle, gunslingers come from many backgrounds, but all have one thing in common. They’re all very good with guns, and use unique fighting styles and speed to strike down any foe that challenges them with less advanced weaponry.",
						{
							"type": "entries",
							"name": "Using Unique Weapons With Style",
							"header": 1,
							"entries": [
								"Though this is heavily dependent on the adventure being run, guns are considered very rare in most adventures, and few know how to operate them. Their exotic nature can lead to confusion and panic among those at the business end of these tools. Gunslingers take advantage of this and combine the usage of these guns with a stylistic grace and speed very few can comprehend. A Gunslinger will hone their skills with these distributors of supersonic lead death and become nearly impossible to track as they strike targets with nearly impossible shots"
							]
						},
						{
							"type": "entries",
							"name": "Born for Adventure",
							"header": 1,
							"entries": [
								"Most adventurers seek adventure out. Others have it thrust upon them. Gunslingers seem to have been born with a natural affinity and curiosity for exploration and dealing with the problems out in the wild. You'll find them at the job board before any paladin or fighter, and they'll be eager to take on the challenges of the darkest and most dangerous dungeons.  The more challenging the encounter, the greater use they'll get out of their pride and joy."
							]
						},
						{
							"type": "entries",
							"name": "Creating a Gunslinger",
							"header": 1,
							"entries": [
								"When creating a gunslinger, consider two major things.  Firstly, consider how rare guns are in the adventure your DM is running, and then consider how your character came across their knowledge of how to make and use them? Did they have a eureka moment in a time of renaissance? Did they train with a mentor before deciding to go on their own path?  Or did they form a pact with a dark entity for this knowledge?  Either way, their background should lead them to come across these deadly tools for use in their adventures."
							]
						},
						{
							"type": "entries",
							"name": "Quick Build",
							"header": 1,
							"entries": [
								"To quickly build a gunslinger, make Dexterity your highest ability score. Secondly, choose an ability score of your choice to be the second highest. This could be Constitution if you want a hardier gunslinger with more health, Charisma if you want a fast talking slinger that can play a mean tune, Intelligence if you want a gunslinger that's well learned and booksmart, or Wisdom if you want a worldy and perceptive master of firearms. Lastly, choose the Folk Hero background."
							]
						}
					]
				}
			]
		}
	],
	"subclass": [
		{
			"name": "Virtuoso",
			"source": "ArcaneArtillery",
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"shortName": "Virtuoso",
			"subclassFeatures": [
				"The Art of Lead|Gunslinger|ArcaneArtillery|Virtuoso|ArcaneArtillery|3",
				"Head In The Game|Gunslinger|ArcaneArtillery|Virtuoso|ArcaneArtillery|9",
				"Skilled & Witty|Gunslinger|ArcaneArtillery|Virtuoso|ArcaneArtillery|13",
				"Trick Prodigy|Gunslinger|ArcaneArtillery|Virtuoso|ArcaneArtillery|17"
			]
		}
	],
	"classFeature": [
		{
			"name": "The Tongue",
			"source": "ArcaneArtillery",
			"page": 13,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 1,
			"entries": [
				"Starting at 1st level, you learn an ancient and ritualized language, practiced often by gunslingers and certain secretive societies of old. It is a deliberate and ritualized code of speech patterns and dialect, each syllable containing complex nuances and multiple meanings. Nowadays, only gunslingers and certain guilds opened by the people of the past still know and actively teach this language. This language can only be understood by those that know the tongue.",
				"Additionally, you understand and can write in a set of ancient symbols and written jargon that conveys the messages of the tongue in deceptively short inscriptions. This writing is generally used to tell stories or to write down spells and rituals, and books containing the tongue are treasures often sought out by linguists and wizards alike due to the potential of finding lost magic or rich historical lore contained within in their text."
			]
		},
		{
			"name": "Quickdraw",
			"source": "ArcaneArtillery",
			"page": 13,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 1,
			"entries": [
				"Also at 1st level, your hands are fast as lightning in a shootout. You can stow one weapon and/or draw another as part of your movement or action before needing to take the Use Object action. Additionally, you do not need a free hand to reload weapons with the loading property."
			]
		},
		{
			"name": "Gun Stunts",
			"source": "ArcaneArtillery",
			"page": 14,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 1,
			"entries": [
				"Starting at 1st level, you have developed a set of stunts you can use to give you an edge in combat. You gain the following options:",
				{
					"type": "list",
					"items": [
						{
							"name": "Run ‘N Gun",
							"type": "entry",
							"entries": ["You can use Dash as a bonus action."]
						},
						{
							"name": "Slinger’s Senses",
							"type": "entry",
							"entries": [
								"You can make a Wisdom(Perception) check as a bonus action if you have a weapon drawn."
							]
						},
						{
							"name": "Stock Strike",
							"type": "entry",
							"entries": [
								"When you make a melee weapon attack using a firearm on your turn, you use your choice of your Strength or Dexterity modifier for the attack and damage rolls.  Additionally, if the attack hits, you can use your bonus action to not provoke opportunity attacks from the target of the attack until the end of your turn."
							]
						}
					]
				}
			]
		},
		{
			"name": "Knack",
			"source": "ArcaneArtillery",
			"page": 14,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 2,
			"entries": [
				"At 2nd level, choose a skill or tool you are proficient in.  Double your proficiency bonus to checks you make with those skills.",
				"When you reach 10th level, you can choose an additional skill or tool proficiency to gain this benefit."
			]
		},
		{
			"name": "Fighting Style",
			"source": "ArcaneArtillery",
			"page": 14,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 2,
			"entries": [
				"At 2nd level, you adopt a particular style of fighting. Choose one of the following options. You cannot choose the same fighting style twice, even if you get to choose again.",
				{
					"type": "options",
					"count": 1,
					"entries": [
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Akimbo Shooting|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Breacher|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Deadeye (Archery Edit)|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Dueling Edit|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Sniper|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Phalanx|ArcaneArtillery"
						}
					]
				}
			]
		},
		{
			"name": "Slinger's Trail",
			"source": "ArcaneArtillery",
			"page": 14,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 3,
			"entries": [
				"At 3rd level, you begin to train your slinging to go down a particular style of emulation. You can choose from either Myth Breaker, Virtuoso, Vaquero, or Delver, all detailed at the end of the class description. The trail you choose grants you features at 3rd level, and again at 9th, 13th, and 17th level."
			]
		},
		{
			"name": "Lucky Item",
			"source": "ArcaneArtillery",
			"page": 14,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 3,
			"entries": [
				"When you reach 3rd level, you have taken up a personal effect that grants you uncanny luck in certain situations and says something interesting about you. This can take the form of a lucky hat that you never take off, a scarf given to you by a lost lover, or a cigar that seems to never run dry. ",
				"Choose a benefit and a quirk from the tables. You can use the benefit’s feature once per long rest. If your lucky item is lost or destroyed, it mysteriously reappears on you at the end of your next long rest. When you reach 13th level, you can choose one additional benefit and quirk. You can use either of the benefits twice before you complete a long rest.",
				{
					"type": "options",
					"count": 1,
					"entries": [
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Deft (Delver)|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Fearless|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Relief|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Rider (Vaquero)|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Seeker (Myth Breaker)|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Sly (Virtuoso)|ArcaneArtillery"
						}
					]
				},
				{
					"type": "options",
					"count": 1,
					"entries": [
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Adept|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Eloquence|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Socialite|ArcaneArtillery"
						},
						{
							"type": "refOptionalfeature",
							"optionalfeature": "Erudite|ArcaneArtillery"
						}
					]
				}
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 4,
			"entries": [
				"When you reach 4th level, and again at 8th level, 12th level, 16th level, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As usual, you can’t increase an ability score above 20 using this feature."
			]
		},
		{
			"name": "Extra Attack",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 5,
			"entries": [
				"At 5th level, you can attack twice, instead of once when you take the attack action on your turn.",
				"Additionally, when you take the Attack action on your turn, you can forgo one of your attacks to reload your weapon."
			]
		},
		{
			"name": "Bullet Time",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 6,
			"entries": [
				"Beginning at 6th level, you've honed your senses to avoid attacks effortlessly. You can now take the Dodge action using a bonus action. You can do this a number of times equal to your Dexterity modifier. You regain the uses of this feature when you complete a short or long rest."
			]
		},
		{
			"name": "Evasion",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 7,
			"entries": [
				"At 7th level, your reflexes are as fast as any bullet you fire from your gun. When you make a Dexterity Saving Throw to take half damage from a damaging effect, such as a shotgun's scattering shells or a black dragon's acid breath, you take no damage on a successful save and only half damage on a failed save."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 8,
			"entries": [
				"When you reach 4th level, and again at 8th level, 12th level, 16th level, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As usual, you can’t increase an ability score above 20 using this feature."
			]
		},
		{
			"name": "Shootout Sense",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 11,
			"entries": [
				"By 11th level, you are ready to react to danger at a moment's notice. You gain advantage on initiative rolls.",
				"Additionally, you can't be surprised while you are conscious."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 12,
			"entries": [
				"When you reach 4th level, and again at 8th level, 12th level, 16th level, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As usual, you can’t increase an ability score above 20 using this feature."
			]
		},
		{
			"name": "Overwatch",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 14,
			"entries": [
				"At 14th level, you can use an action to lie in wait to take an action against any enemy that reveals itself. If a creature moves, makes a weapon attack, or casts a spell while within your firearm's range, you can use your reaction to make an attack against them.",
				{
					"name": "Saving Throws",
					"type": "entries",
					"entries": [
						"Overwatch requires targets to make a saving throw to resist the penalites imposed on them. The Saving throw DC is as follows:"
					]
				},
				{
					"type": "abilityDc",
					"name": "Overwatch",
					"attributes": ["dex"]
				},
				"On a hit, the following effects are imposed in addition to the attack's normal effects.",
				{
					"type": "list",
					"iitems": [
						"If the attack was triggered by the target's movement, it must make a Dexterity saving throw. On a failed save, its movement speed is reduced by half until the end of your next turn. On a successful save, their speed is only reduced by 10 until the end of your next turn.",
						"If the attack was triggered by the creature making a weapon attack, it must make a Constitution saving throw.  On a failed save, it has disadvantage on attack rolls until the start of your next turn. On a successful save, it only has disadvantage on the triggering attack.",
						"If the attack was triggered by the creature casting a spell, it must make a Constitution save. On a failed save, the target(s) of the spell have advantage on the saving throw to resist the effects of the spell, in addition all targeted creatures gain resistance to the spells damage. If the spell requires a spell attack roll it would be made with disadvantage."
					]
				}
			]
		},
		{
			"name": "Final Stand",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 15,
			"entries": [
				"Starting at 15th level, when you are reduced to 0 hit points and don’t die outright, you can use your reaction before you fall unconscious to make an attack roll at an enemy. This attack is made with disadvantage. If the attack hits, you gain hit points equal to {@dice 1d8} + your gunslinger level. Once you use this feature, you cannot use it again until you complete a short or long rest."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 16,
			"entries": [
				"When you reach 4th level, and again at 8th level, 12th level, 16th level, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As usual, you can’t increase an ability score above 20 using this feature."
			]
		},
		{
			"name": "Superhuman Reflexes",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 18,
			"entries": [
				"At 18th level, a you have sharpened your reflexes to supersonic proportions. You now get the following benefits:",
				{
					"type": "list",
					"items": [
						"You can use Disengage as a bonus action.",
						"Once per short rest, when you are hit by a ranged attack, you can reduce the damage of that attack to 0.",
						"You can use two gun stunts as a bonus action once per short or long rest."
					]
				}
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 19,
			"entries": [
				"When you reach 4th level, and again at 8th level, 12th level, 16th level, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As usual, you can’t increase an ability score above 20 using this feature."
			]
		},
		{
			"name": "Gunslinger Supreme",
			"source": "ArcaneArtillery",
			"page": 15,
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"level": 20,
			"entries": [
				"By the time you reach 20th level, you have become an undisputed slinger extraordinare. Add your proficiency bonus to damage rolls you make with your firearms, except when making an attack that does not normally apply your ability score modifier to it's damage. (For example, making an offhand attack.)",
				"Additionally, if you use the automatic or burst fire area of effect action, you can make one weapon attack as a bonus action."
			]
		}
	],
	"optionalfeature": [
		{
			"name": "Akimbo Shooting",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"When you take the attack action with a light weapon, you can use a bonus action to make an attack with a light ranged weapon you are holding. You do not add your ability score modifier to the damage of this attack, unless that modifier is negative."
			],
			"featureType": ["FS:GS"]
		},
		{
			"name": "Breacher",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"When you hit with a ranged attack roll, you roll a 1 or 2 on the damage die, you can reroll the damage die and must take the new roll, even if the number is a 1 or a 2. The weapon must have the scatter property in order to gain this benefit."
			],
			"featureType": ["FS:GS"]
		},
		{
			"name": "Deadeye (Archery Edit)",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"You get a +2 bonus to attack rolls you make with martial and simple ranged weapons, as well as longarms which do not have the bulky or scatter property."
			],
			"featureType": ["FS:GS"]
		},
		{
			"name": "Dueling Edit",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"When wielding a one-handed weapon in one hand and no other weapons, you get a +2 bonus to your damage rolls with these weapons. This additional damage only applies for ranged attacks made at creatures within 30 feet of you."
			],
			"featureType": ["FS:GS"]
		},
		{
			"name": "Sniper",
			"source": "ArcaneArtillery",
			"page": 14,
			"featureType": ["FS:G"],
			"entries": [
				"You gain a +2 bonus to damage rolls if you attack a creature further than 30 feet away from you with a ranged weapon or a firearm that does not have the scatter property."
			]
		},
		{
			"name": "Phalanx",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"You can now wield a two-handed melee weapon, heavy crossbow, light crossbow, or a longarm with a shield, but you must use an action to brace the weapon against the shield in order to attack with it.",
				"The weapon stays braced in this way as long as you move no more than 10 feet during your turn. The weapon loses any benefits you gain from using it with two hands while braced."
			],
			"featureType": ["FS:GS"]
		},
		{
			"name": "Deft (Delver)",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"You get the identify and locate object spells and can cast them as rituals.  "
			],
			"featureType": ["LI:BF"]
		},
		{
			"name": "Fearless",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"You can use an action to end one effect on yourself that is causing you to be frightened."
			],
			"featureType": ["LI:BF"]
		},
		{
			"name": "Relief",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"You can spend one minute meditating with your item in hand, after which you regain hit die equal to one third your gunslinger level (rounded down)."
			],
			"featureType": ["LI:BF"]
		},
		{
			"name": "Rider (Vaquero)",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"You gain the beast bond spell, and can cast it as a ritual."
			],
			"featureType": ["LI:BF"]
		},
		{
			"name": "Seeker (Myth Breaker)",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"You get the hunter's mark spell, and can cast it once per long rest without expending a spell slot."
			],
			"featureType": ["LI:BF"]
		},
		{
			"name": "Sly (Virtuoso)",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"You gain one Battlemaster Maneuver and treat it as a Virtuoso Trick."
			],
			"featureType": ["LI:BF"]
		},
		{
			"name": "Adept",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"You gain proficiency in two weapons of your choosing."
			],
			"featureType": ["LI:QR"]
		},
		{
			"name": "Eloquence",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": ["You learn two languages of your choosing."],
			"featureType": ["LI:QR"]
		},
		{
			"name": "Socialite",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"You gain proficiency in two gaming sets of your choosing."
			],
			"featureType": ["LI:QR"]
		},
		{
			"name": "Erudite",
			"source": "ArcaneArtillery",
			"page": 14,
			"entries": [
				"You gain proficiency in one skill or tool of your choice."
			],
			"featureType": ["LI:QR"]
		},
		{
			"name": "Break Cover",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				"Spend a superiority die to attack a creature in cover with an attack roll. Add the number rolled to the attack's damage. This attack ignores any cover bonuses the target is benefiting from."
			],
			"featureType": ["TRKS"]
		},
		{
			"name": "Commander's Strike",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				"When you take the Attack action on your turn, you can forgo one of your attacks and use a bonus action to direct one of your companions to strike. When you do so, choose a friendly creature who can see or hear you and expend one superiority die. That creature can immediately use its reaction to make one weapon attack, adding the superiority die to the attack's damage roll."
			],
			"featureType": ["TRKS"]
		},
		{
			"name": "Concussive Attack",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				"When you make a successful weapon attack, you can spend a superiority die and add the number rolled to the attack's damage. You cause your target to be discombobulated, imposing disadvantage on the next attack they make."
			],
			"featureType": ["TRKS"]
		},
		{
			"name": "Disarming Attack",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				"Make an attack roll and expend a superiority die and add the number rolled to the attack's damage. If it succeeds, you force the creature hit to drop one of its held items. The creature must make a Strength saving throw. If they fail, they drop the held item down to their feet."
			],
			"featureType": ["TRKS"]
		},
		{
			"name": "Disorienting Attack",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				" When you make a successful weapon attack, you can spend a superiority die to disorient them, giving allies an opening. The next attack roll that's made against the target has advantage if the attack is made before the start of your next turn. Add the result of your superiority die to the ally's attack roll."
			],
			"featureType": ["TRKS"]
		},
		{
			"name": "Evasive Footwork",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				"When you move, you can expend one superiority die, rolling the die and adding the number rolled to your AC until you stop moving."
			],
			"featureType": ["TRKS"]
		},
		{
			"name": "Intercept",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				" When an enemy that you can see makes a ranged spell attack or a ranged attack within your firearm's range, you can expend a superiority die in order to use a reaction to attempt to shoot it out of the air. Make a ranged weapon attack against the missile or spell. Add the number rolled on your superiority die to the attack roll. These missiles and ranged spells have an AC equal to the attack roll of the creature that shot or cast them. If you succeed, the attack automatically fails as you strike it and either interrupts its effects or knocks it off course. You can use this trick before or after the attack roll is made, but before it's revealed to be a hit or a miss."
			],
			"featureType": ["TRKS"]
		},
		{
			"name": "Piercing Attack",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				"When you hit with a ranged weapon attack, you can expend a superiority die to have the shot continue on through the target after hitting it in order to attempt to damage an additional creature. If the creature within range of your shot and in the same line as your shot would have been hit by your attack roll, they take damage equal to the number rolled on your superiority die + your Dexterity or Charisma modifier. The damage is the same as the type dealt by the original attack."
			],
			"featureType": ["TRKS"]
		},
		{
			"name": "Precision Attack",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				"When you make a weapon attack roll against a creature, you can expend one superiority die and add the number rolled to the roll. You can use this trick before or after making the attack roll, but before any effects of the attack are applied."
			],
			"featureType": ["TRKS"]
		},
		{
			"name": "Rocket Jump",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				"If you make a jump, you can spend a superiority die to make the jump with vim and vigor, adding the number rolled + your Dexterity modifier to that jump's distance."
			],
			"featureType": ["TRKS"]
		},
		{
			"name": "Slinger's Luck",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				" If your weapon would misfire, you can expend a superiority die in order to channel the inherent luck of your craft to avoid the misfire entirely. Add the number rolled on your superiority die to your next attack roll."
			],
			"featureType": ["TRKS"]
		},
		{
			"name": "Trip Attack",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				"When you hit a creature with a weapon attack, you can expend one superiority die to attempt to knock the target down. You add a superiority die to the attack’s damage roll, and if the target is Large or smaller, it must make a Strength saving throw. On a failed save, you knock the target prone."
			],
			"featureType": ["TRKS"]
		},
		{
			"name": "Warning Attack",
			"source": "ArcaneArtillery",
			"page": 17,
			"entries": [
				"When you miss a creature with a weapon attack, you can expend a superiority die to attempt to frighten the target as the shot whizzes past them. The target must make a Wisdom saving throw. Subtract the result of your superiority die from their roll. On a failed save, it is frightened of you until the end of your next turn."
			],
			"featureType": ["TRKS"]
		}
	],
	"subclassFeature": [
		{
			"name": "The Art of Lead",
			"source": "ArcaneArtillery",
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"subclassShortName": "Virtuoso",
			"subclassSource": "ArcaneArtillery",
			"level": 3,
			"entries": [
				"Starting when you choose this trail at level 3, Virtuosos get a bevy of special skills enhanced by special dice called superiority dice.",
				{
					"name": "Tricks",
					"type": "entries",
					"entries": [
						"You learn three tricks of your choice, which are detailed under \"tricks\" below. Many tricks enhance an attack or assist allies/debilitate enemies in some way, shape or form.  You can only use one trick per attack.",
						"You learn two additional tricks at 9th level, 13th level, and 17th level. Each time you learn a new trick, you can also replace one Trick you know with a different one.",
						{
							"type": "options",
							"count": 3,
							"entries": [
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Break Cover|ArcaneArtillery"
								},
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Commander's Strike|ArcaneArtillery"
								},
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Concussive Attack|ArcaneArtillery"
								},
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Disarming Attack|ArcaneArtillery"
								},
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Disorienting Attack|ArcaneArtillery"
								},
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Evasive Footwork|ArcaneArtillery"
								},
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Intercept|ArcaneArtillery"
								},
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Piercing Attack|ArcaneArtillery"
								},
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Precision Attack|ArcaneArtillery"
								},
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Rocket Jump|ArcaneArtillery"
								},
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Slinger's Luck|ArcaneArtillery"
								},
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Trip Attack|ArcaneArtillery"
								},
								{
									"type": "refOptionalfeature",
									"optionalfeature": "Warning Attack|ArcaneArtillery"
								}
							]
						}
					]
				},
				{
					"name": "Superiority Dice",
					"type": "entries",
					"entries": [
						"You have four superiority dice, which are {@dice 1d8}s, to spend on Tricks. When you use a superiority die, it's expended. You regain all your superiority dice when you finish a short or long rest. You get an additional superiority die at 9th level, and one more at 17th level."
					]
				},
				{
					"name": "Superiority Dice Improvements",
					"type": "entries",
					"entries": [
						" Superiority dice turn into {@dice 1d10}s at 9th level and {@dice 1d12}s at 17th level."
					]
				},
				{
					"name": "Saving Throws",
					"type": "entries",
					"entries": [
						"Some of your Tricks require your target to make a saving throw to resist the trick's effects. The save DC is calculated as follows:"
					]
				},
				{
					"type": "abilityDc",
					"name": "Trick",
					"attributes": ["dex", "cha"]
				}
			]
		},
		{
			"name": "Head In The Game",
			"source": "ArcaneArtillery",
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"subclassShortName": "Virtuoso",
			"subclassSource": "ArcaneArtillery",
			"level": 9,
			"entries": [
				"At 9th level, you are constantly on top of your game, and are always ready for action. You add your Charisma modifier to your initiative rolls.",
				"Additionally, you gain proficiency in Wisdom saving throws."
			]
		},
		{
			"name": "Skilled & Witty",
			"source": "ArcaneArtillery",
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"subclassShortName": "Virtuoso",
			"subclassSource": "ArcaneArtillery",
			"level": 13,
			"entries": [
				"Starting at 13th level, you have become an epitome of expertise and sheer skill, both on and off the battlefield. You learn an additional skill, tool, or language of your choice.  Alternatively, you can choose a skill or tool you are proficient in. Double your proficiency bonus for checks made using that skill or tool.",
				"Additionally, you get advantage on Persuasion and Intimidation checks when trying to defuse a fight."
			]
		},
		{
			"name": "Trick Prodigy",
			"source": "ArcaneArtillery",
			"className": "Gunslinger",
			"classSource": "ArcaneArtillery",
			"subclassShortName": "Virtuoso",
			"subclassSource": "ArcaneArtillery",
			"level": 17,
			"entries": [
				"Once you reach 17th level, you regain 1 superiority die if you roll initiative and have no superiority dice remaining."
			]
		}
	]
}
